#? --------------------------------------------- بسم الله الرحمن الرحيم ---------------------------------------------
#* --------------------------------------------- Start Again (( 15/4/2026 )) **Cryptic_x01** ---------------------------------------------
# ? ------------------------------------- 01 -------------------------------------
# لعملم ملف bash script يكون بالخطوات التاليه 
# 1 ) نفتح ال terminal ونكتب $ touch namefile.sh | $ nano namefile.sh
# 2 ) علشان نظام التشغيل يفهم ان دا ملف bash script لازم نكتب في اول سطر السطر التالي
# >>>>>>>>>>>>>> #!/bin/bash <<<<<<<<<<<<<<<<<
# 3 ) بعد كتابه الاوامر الي عايز تشغلها من خلال الملف دا لازم اهم خطوه بقي وهي كالتالي
# -1- لتشغيل الملف بشكل طبيعي نكتب ( $ bash namefile.sh ) اول طريقة
# t~ -----------------
# -2- تغير صلاحيات الملف من خلال كتابه هذا الامر في terminal ( $ chmod +x namefile.sh )
# -2.1- بعد كدا علشان نشغل الملف بشكل طبيعي بنكتب الامر دا في ال termianl ( $ ./namefile.sh )
#* ----------------- Command in file bash
mkdir filename # بالشكل دا كدا هنخلي ملف الاسكربت لمه نشغله يعمل ملف جديد
ls -la # كدا هنخلي لمه يتشغل يعمل عرض للملفات الي موجوده وكذا 
# ? ------------------------------------- 02 -------------------------------------
echo -n "Hello1" # علشان اعرض السطرين جنب بعض نستخدم -n  >> Hello1Hello2 هتبقي كدا
echo "Hello2"

echo -e "Hello3\nKKkk" # علشان اقدر استخدم ال \n \\ \t \b \v لازم نستخدم ال -e 
echo "Hello4"

namevar="Welcome" # علشان نعمل متغير ونخزن في قيمة بيكون بالشكل دا بالظبط
echo "$namevar Cryptic_x01" # وللطباعة نستخدم echo ثم علامات التنصيص 
# وعلشان نستدعي ال المتغير لازم نستخدم علامه $ قبل اسمه بهذا الشكل التقليدي

echo "${namevar}Cryptic_x01" # علشان افرق بين المتغير و الكلام الي جنبه بحط اسم المتغير بداخل ${namevar} بهذا الشكل
# بمعني ان المتغير بتاعي هو ال داخل ال {} فقط
#? ------------------------------------- 03 -------------------------------------
# Video 3 => https://www.youtube.com/watch?v=GbY3BzS1GMI&list=PLBdyyeW_Z41DykncH9zzMk8T7Rm5UlZXd&index=3
#? ------------------------------------- 03 -------------------------------------
my_date=date # يمكننا عمل متغير ونخلي يعرض ال result بتاع الامر دا من خلال اسم المتغير 
$my_date # كدا هنشغل المتغير الي هو يعتبر امر ال date

my_date=$(date) # بالشكل دا كدا احنا عملنا تخزين لل output بتاع ال date في الوقت الحالي
echo "Date : $my_date" # وطبعنا بالشكل الطبيعي بتاع echo 

readonly lists=$(ls) # نستخدم امر readonly علشان ميقدرش حد يغير قيمه المتغير دا بعد كدا 
echo $lists

lists=$(pwd) #! ERROR مش هنعرف نغير قمته لان استخدمنا readonly فوق
echo $lists #! ERROR ( lists: readonly variable )

# شرح المتغيرات 

# 1 ) $0 >> هي عباره عن اسم ملف الاسكربت ./bash.sh
echo "File Name : $0"

# 2 ) $1 - N >> هو العنصر الي جنب اسم ملف الاسكربت زي ما وضحنا تحت كدا بالظبط 
#     $0      $1       $2       $3      >$etc...
# ./bash.sh  cryptic  hacking  redteam
echo "File Name : $0 ,, Arg One : $1 ,, Arg Two : $2"

# 3 ) $#  >> تستخدم لطباعه عدد ال arg الي جنب اسم الاسكربت
# terminal > $ ./bash.sh arg1 arg2 arg3
echo $# # دي كدا هتطبع عدد ال arg الي جنب اسم الاسكربت

# 4 ) $@ >> تستخدم لطابعة جميع العناصر الي جنب اسم الاسكربت  
# ( "$1" "$2" "$3" ... ) النوع دا بيخلي كل عنصر من العناصر لوحده
echo $@

# 5 ) $* >>  تستخدم لطابعة جميع العناصر الي جنب اسم الاسكربت ولكن
# ( "$1 $2 $3 ... " ) بيخلي كل العناصر كلمه واحده
echo $*

# 6 ) $? >> بتطبع 0 لو الكود تمام غير كدا بيطبع 127 يبقي الكود او اخر امر في مشكله
echo $?

# 7 ) $$ >> بيطبع رقم العمليه الي هو  Process ID (PID) in Shell
echo $$

# 8 ) $! >> PID لخط أنابيب الخلفية الذي تم تنفيذه مؤخرًا
echo $!

# 9 ) $_ >> لطباعه اخر حاجه حصلت في الامر او الاسكربت
echo $_

# 10 ) $- >> تم تعيين الخيارات الحالية لل shell
echo $-

#? ------------------------------------- 04 -------------------------------------
# Video 4 => https://www.youtube.com/watch?v=JdR-8lLiwyo&list=PLBdyyeW_Z41DykncH9zzMk8T7Rm5UlZXd&index=4
#? ------------------------------------- 04 -------------------------------------
# "" => Double Quotes >> بتفهم المتغير الي جوها 
var="Double Quotes"
echo "Hello $var" # output > Hello Double Quotes
#* ------------------------------
# \$ >> علشان ميفهمش ان دا متغير لازم نستخدم ال \ قبل ال $ علشان يبفهم ان دا مش متغير
# دا بالنسبة لل ""
echo "$0.00" # output > ./bash.sh
echo "\$5.00" # output > $5.00
#* ------------------------------
# '' => Single Quotes >> مش بتفهم المتغير الي جوها بتعتبر كله نص واحد
var2="Single Quotes"
echo 'Hello $var2' # output > Hello $var2
#* ------------------------------
# امال لو بنستخدم '' الامر بيختلف بيفهم ان كل الي مكتوب جوها نص واحد
echo '$5.00' # output > $5.00
#* ------------------------------
# `` => Backticks => تستخدم لتطبيق امر معين وهذه طريقه قديمه
echo "Date : `date`" # دي الطريقه القديمه => Date : Thu, Apr 16, 2026 11:10:19 am
#* ------------------------------
echo "Date : $(date)" # دي الطريقه الجديده => Date : Thu, Apr 16, 2026 11:10:19 am
#? ------------------------------------- 05 -------------------------------------
# Video 5 => https://www.youtube.com/watch?v=ex60OTFAfm0&list=PLBdyyeW_Z41DykncH9zzMk8T7Rm5UlZXd&index=5
#? ------------------------------------- 05 -------------------------------------
# -p: لعرض السؤال (Prompt).
# -s: للأمان (يخفي ما تكتبه).
# -t: يحدد عدد ثوانٍ للانتظار، إذا لم يتم الإدخال ينتهي الأمر تلقائياً.
# -d: (Delimiter) لإنهاء الإدخال عند حرف معين بدلاً من زر Enter.
# -N: (Number exact) مثل -n ولكن لا يتوقف إلا بعد استلام العدد المطلوب "بالضبط".
# -n: (Number) لإنهاء الإدخال تلقائياً بعد كتابة عدد محدد من الحروف
# -r: يحمي الـ \ (مثل مسارات ويندوز).
# -e: يجعلك "ملك" السطر (تحكم بالأسهم و Tab).
# -u: (Unit/FD) للقراءة من "ملف" أو Descriptor معين بدلاً من لوحة المفاتيح.
# -i: (Initial) لوضع نص افتراضي (Default) داخل الخانة (يجب استخدامه مع -e).
# -a: (Array) لتخزين الكلمات المدخلة داخل "مصفوفة" (Array) بدلاً من متغير واحد.
#* ------------------------------
# read >> عباره عن input بتاخده من المستخدم
# دي الطريقه التقليدية ل اخذ ال input من المستخدم
echo -n "Enter Name : "
read name
echo "Welcome $name"
#* ------------------------------
# read -p >> يعني تقدر تكتب رساله جنب ال input بدل استخدام echo الي فوق
read -p "Enter Name : " name2
echo "Welcome $name2"
#* ------------------------------
# read -s >> تستخدم لاخفاء ال input
read -sp "Enter Passwd : " passwd
echo "Welcome $passwd"
#* ------------------------------
# echo -e "\n etc.. ">> في مشكله هتقابلنا هنا وهي لمه يجي يطبع رساله ال echo هتطبع جنب ال input الي حطتيه 
# علشان نتفاده المشكله دي نعمل التالي
read -sp "Enter Passwd : " passwd
echo -e "\nWelcome $passwd"
#* ------------------------------
# او باستخدام ال printf
read -sp "Enter Passwd : " passwd
printf "\nWelcome %s" "$passwd"
#* ------------------------------
# read -t 4 >> تستخدم بهذا الشكل لتحديد وقت وضع ال Input
# يعني لو ال 4 ثواني خلصوا كدا خلاص مش هيستقبل input منك
read -t 4 -sp ": " name
echo -e "\n ${name}"
#* ------------------------------
# read -d "." >> تستخدم لتحديد كلمه معينه اول ما تكتبها في ال input هيقف ويتسجل علي كدا 
read -d "." name
echo -e "\nWelcome ${name}"
#* ------------------------------
# لعرض رساله مع ال delim بيكون بهذا الشكل
read -d "." -p "Enter Name (end with .): " name
echo -e "\nWelcome ${name}"
#* ------------------------------
# read -N 9 >> تستخدم لوضع حد لحروف الادخال يعني لازم 9 حروف كدا مينفعش اقل او اكثر
read -N 9 -p "Enter Name : " name
echo -e "\nWelcome ${name}"
#* ------------------------------
# read -n 9 >> تستقبل من 9 و اقل يعني رقم 9 دا حد اقصي للادخال
# يستقبل من 1 الي 9
read -n 9 -p "Enter Name : " name
echo -e "\nWelcome ${name}"
#* ------------------------------
# read -e >> بيخليك تقدر تمسح وتعدل الكلام الخظاء الي في ال input وتقدر تتحرك يميناً ويساراً داخل النص
# مكن للمستخدم الضغط على زر Tab لتكملة اسم الملف أو المجلد تلقائياً، تماماً كما نفعل في Terminal
# تسمح للمستخدم بالضغط على السهم لأعلى لاسترجاع آخر نص قام بكتابته في نفس جلسة
read -e -p "Enter Name : " name
echo -e "\nWelcome ${name}"
#* ------------------------------
# read -r >>  لقراءة النص "خام" كما هو وتجاهل معاني الـ \
read -r -p "Enter Name: " name
# لو المستخدم كتب: Hello \n World
echo "Welcome ${name}"
#* ------------------------------
# read -i >> لوضع قيمه افتراضيه مثل كلمه admin ولازم نستخدم معاها -e
read -re -p "Enter Username: " -i "admin" username
echo "The username is: $username"
#* ------------------------------
# read -a >> كدا الادخال بتاعك اصبح array يعني اصبح list in python
read -p "Enter your favorite fruits (separated by space): " -a fruits
echo "The first fruit is: ${fruits[0]}"
echo "ALl fruit: ${fruits[@]}"
echo "Total fruits entered: ${#fruits[@]}"
#* ------------------------------
# IFS="," >> دي معنها ان افصل بين الادخالات من خلال الفصله لان الافتراضي هو " " المسطره
# تغيير الـ IFS (اختصار لـ Internal Field Separator) هو الطريقة التي تخبر بها Bash: "لا تقسم الكلام عند المسافة، بل قسمه عند هذه العلامة".
IFS="," read -p "Enter items (split by comma): " -a my_items
echo "First item: ${my_items[0]}"
echo "Second item: ${my_items[1]}"
#? ------------------------------------- 06 -------------------------------------
# Video 6 => https://www.youtube.com/watch?v=pBrQl6muY4g&list=PLBdyyeW_Z41DykncH9zzMk8T7Rm5UlZXd&index=6

#                          >>>>>>>>> Arithmetic Operators Part 1 <<<<<<<<<<
#? ------------------------------------- 06 -------------------------------------
# $((5+4)) >> هي طريقه لعمل اي عملية حسابية
result=$((5+4))
echo $result
#* ------------------------------
read -p "Enter First Num : " var1
read -p "Enter Second Num : " var2
echo "$var1 + $var2 => $((var1+var2))"
echo "$var1 - $var2 => $((var1-var2))"
echo "$var1 * $var2 => $((var1*var2))"
echo "$var1 / $var2 => $((var1/var2))"
echo "$var1 % $var2 => $((var1%var2))"
echo "$var1 ** $var2 => $((var1**var2))"
#* ------------------------------ >> ./bash.sh 5 5
var1=$1
var2=$2
echo "$var1 + $var2 => $((var1+var2))" # 10
echo "$var1 - $var2 => $((var1-var2))" # 0
echo "$var1 * $var2 => $((var1*var2))" # 25
echo "$var1 / $var2 => $((var1/var2))" # 1
echo "$var1 % $var2 => $((var1%var2))" # 0
echo "$var1 ** $var2 => $((var1**var2))" # 3125
#* ------------------------------
# $((++var1 + 2)) >> بالشكل دا كدا هيضف 1 قبل الجمع ثم يبداء يجمع
# ال ++ الي في الاول دي معنها ضيف واحد علي قيمه المتغير دا قبل الجمع
# 5 + 1 = 6 ,, 6 + 2 = 8
var1=5
echo $((++var1 + 2))
#* ------------------------------
# $((var2++ + 2)) >> دي معنها ضيف 1 بس بعد عمليه الجمع او ضيف واحد بس بعد كدا مش دلوقتي
# 8 + 2 = 10 ,, 10 + 1 = 11
var2=8
echo $((var2++ + 2))
echo $var2
#? ------------------------------------- 07 -------------------------------------
# Video 7 => https://www.youtube.com/watch?v=q6XNA8pS2ew&list=PLBdyyeW_Z41DykncH9zzMk8T7Rm5UlZXd&index=7

#                          >>>>>>>>> Arithmetic Operators Part 2 <<<<<<<<<<
#? ------------------------------------- 07 -------------------------------------
# expr 5 + 3 >> نستخمد هذا الامر لنه هو الووحيد الي بيتعامل مع العمليات الحسابية
# expr 5 + 3 == echo $((5 + 3)) دي هي هي نفس دي بالظبط
expr 5 + 3 # => 8
echo $((5 + 3)) # => 8
#* ------------------------------
# استخدمنا $((var1 ** var2)) بدل `expr $var1 ** $var2` لان فيها مشكله
var1=6
var2=3
echo "$var1 + $var2 = `expr $var1 + $var2`"
echo "$var1 - $var2 = `expr $var1 - $var2`"
echo "$var1 * $var2 = `expr $var1 \* $var2`"
echo "$var1 / $var2 = `expr $var1 / $var2`"
echo "$var1 % $var2 = `expr $var1 % $var2`"
echo "$var1 ** $var2 = $((var1 ** var2))"
#* ------------------------------
# ${#varS} == $(expr length ${varS}) == `expr length $varS` تستخدم هذه الطريقة لطباعة عدد عناصر المتغير
varS="Hello"
echo `expr length $varS` # => 5
echo $(expr length ${varS}) # => 5
echo ${#varS} # => 5
#* ------------------------------ >length>
# ولكن في حاجه مهمه ان لو كتابنا اي كلمه ثانيه جنب Hello هيحصل error عند او اثنين 
# ${#varS} ودي بس الي هتشتغل
# ${#varS} دي اقوي واسرع لانها bultin
varS="Hello Man"
echo `expr length $varS` # expr: syntax error: unexpected argument ‘Bash’
echo $(expr length ${varS}) # expr: syntax error: unexpected argument ‘Bash’
echo ${#varS} # => 9
# حل المشكله دي انك تحط المتغير بداخل "$varS" علشان يفهم انهم عنصر واحد مش كل واحده لوحدها
echo `expr length "$varS"` # 9
# حل المشكله دي انك تحط المتغير بداخل "${varS}" 
echo $(expr length "${varS}") # 9
#* ------------------------------ >index>
# index >> تستخدم للبحث عن حرف وبيرجعلك برقم ال index بتاعه
varS="Hello Man"
echo `expr index $varS M` # expr: syntax error: unexpected argument ‘M’
# نفس الفكره برضو هنا لازم نحط المتغير بداخل ال Double Quotes "$varname"
echo `expr index "$varS" M` # 7
#* ------------------------------ >substr>
# substr >> تستخدم لقص جزاء معين يعني مثلا من اول ال index 1 قص 7 حروف 
varS="HelloMan"
echo `expr substr $varS 1 7` # HelloMa
#* ------------------------------ >substr>
# ${varS:0:7} ==>> `expr substr $varS 1 7` الطريقة دي اسهل من الطريقه الاوله بتاعت ال expr
varS="HelloMan"
# يبدأ من 0 ويأخذ 7 حروف
echo "${varS:0:7}"  # النتيجة: HelloMa
#* ------------------------------ >match>
# match >> تستخدم للبحث عن كلمه كامله ولازم تكون هي بدايه البحث يعني مش في نص كلمه لا لازم تكون هي البداية
# هنا استخدمنا .* يعني كلمه Welcome واي حاجه بعدها 
var="Welcome2024"
# هل النص يبدأ بكلمة Welcome متبوعة بأي حروف؟
expr match "$var" "Welcome.*"
# النتيجة: 11 (لأن الكلمة بالكامل 11 حرف وتطابقت مع النمط)
#? ------------------------------------- 08 -------------------------------------
# Video 8 => https://www.youtube.com/watch?v=_hlWUfYMW4Q&list=PLBdyyeW_Z41DykncH9zzMk8T7Rm5UlZXd&index=8

#                          >>>>>>>>> Arithmetic Operators Part 3 <<<<<<<<<<
#? ------------------------------------- 08 -------------------------------------
