#? --------------------------------------------- بسم الله الرحمن الرحيم ---------------------------------------------
#* --------------------------------------------- Start Again (( 15/4/2026 )) **Cryptic_x01** ---------------------------------------------
# ? ------------------------------------- 01 -------------------------------------
# لعملم ملف bash script يكون بالخطوات التاليه 
# 1 ) نفتح ال terminal ونكتب $ touch namefile.sh | $ nano namefile.sh
# 2 ) علشان نظام التشغيل يفهم ان دا ملف bash script لازم نكتب في اول سطر السطر التالي
# >>>>>>>>>>>>>> #!/bin/bash <<<<<<<<<<<<<<<<<
# 3 ) بعد كتابه الاوامر الي عايز تشغلها من خلال الملف دا لازم اهم خطوه بقي وهي كالتالي
# -1- لتشغيل الملف بشكل طبيعي نكتب ( $ bash namefile.sh ) اول طريقة
# t~ -----------------
# -2- تغير صلاحيات الملف من خلال كتابه هذا الامر في terminal ( $ chmod +x namefile.sh )
# -2.1- بعد كدا علشان نشغل الملف بشكل طبيعي بنكتب الامر دا في ال termianl ( $ ./namefile.sh )
#* ----------------- Command in file bash
mkdir filename # بالشكل دا كدا هنخلي ملف الاسكربت لمه نشغله يعمل ملف جديد
ls -la # كدا هنخلي لمه يتشغل يعمل عرض للملفات الي موجوده وكذا 
# ? ------------------------------------- 02 -------------------------------------
echo -n "Hello1" # علشان اعرض السطرين جنب بعض نستخدم -n  >> Hello1Hello2 هتبقي كدا
echo "Hello2"

echo -e "Hello3\nKKkk" # علشان اقدر استخدم ال \n \\ \t \b \v لازم نستخدم ال -e 
echo "Hello4"

namevar="Welcome" # علشان نعمل متغير ونخزن في قيمة بيكون بالشكل دا بالظبط
echo "$namevar Cryptic_x01" # وللطباعة نستخدم echo ثم علامات التنصيص 
# وعلشان نستدعي ال المتغير لازم نستخدم علامه $ قبل اسمه بهذا الشكل التقليدي

echo "${namevar}Cryptic_x01" # علشان افرق بين المتغير و الكلام الي جنبه بحط اسم المتغير بداخل ${namevar} بهذا الشكل
# بمعني ان المتغير بتاعي هو ال داخل ال {} فقط
#? ------------------------------------- 03 -------------------------------------
# Video 3 => https://www.youtube.com/watch?v=GbY3BzS1GMI&list=PLBdyyeW_Z41DykncH9zzMk8T7Rm5UlZXd&index=3
#? ------------------------------------- 03 -------------------------------------
my_date=date # يمكننا عمل متغير ونخلي يعرض ال result بتاع الامر دا من خلال اسم المتغير 
$my_date # كدا هنشغل المتغير الي هو يعتبر امر ال date

my_date=$(date) # بالشكل دا كدا احنا عملنا تخزين لل output بتاع ال date في الوقت الحالي
echo "Date : $my_date" # وطبعنا بالشكل الطبيعي بتاع echo 

readonly lists=$(ls) # نستخدم امر readonly علشان ميقدرش حد يغير قيمه المتغير دا بعد كدا 
echo $lists

lists=$(pwd) #! ERROR مش هنعرف نغير قمته لان استخدمنا readonly فوق
echo $lists #! ERROR ( lists: readonly variable )

# شرح المتغيرات 

# 1 ) $0 >> هي عباره عن اسم ملف الاسكربت ./bash.sh
echo "File Name : $0"

# 2 ) $1 - N >> هو العنصر الي جنب اسم ملف الاسكربت زي ما وضحنا تحت كدا بالظبط 
#     $0      $1       $2       $3      >$etc...
# ./bash.sh  cryptic  hacking  redteam
echo "File Name : $0 ,, Arg One : $1 ,, Arg Two : $2"

# 3 ) $#  >> تستخدم لطباعه عدد ال arg الي جنب اسم الاسكربت
# terminal > $ ./bash.sh arg1 arg2 arg3
echo $# # دي كدا هتطبع عدد ال arg الي جنب اسم الاسكربت

# 4 ) $@ >> تستخدم لطابعة جميع العناصر الي جنب اسم الاسكربت  
# ( "$1" "$2" "$3" ... ) النوع دا بيخلي كل عنصر من العناصر لوحده
echo $@

# 5 ) $* >>  تستخدم لطابعة جميع العناصر الي جنب اسم الاسكربت ولكن
# ( "$1 $2 $3 ... " ) بيخلي كل العناصر كلمه واحده
echo $*

# 6 ) $? >> بتطبع 0 لو الكود تمام غير كدا بيطبع 127 يبقي الكود او اخر امر في مشكله
echo $?

# 7 ) $$ >> بيطبع رقم العمليه الي هو  Process ID (PID) in Shell
echo $$

# 8 ) $! >> PID لخط أنابيب الخلفية الذي تم تنفيذه مؤخرًا
echo $!

# 9 ) $_ >> لطباعه اخر حاجه حصلت في الامر او الاسكربت
echo $_

# 10 ) $- >> تم تعيين الخيارات الحالية لل shell
echo $-

#? ------------------------------------- 04 -------------------------------------
# Video 4 => https://www.youtube.com/watch?v=JdR-8lLiwyo&list=PLBdyyeW_Z41DykncH9zzMk8T7Rm5UlZXd&index=4
#? ------------------------------------- 04 -------------------------------------
# "" => Double Quotes >> بتفهم المتغير الي جوها 
var="Double Quotes"
echo "Hello $var" # output > Hello Double Quotes

# \$ >> علشان ميفهمش ان دا متغير لازم نستخدم ال \ قبل ال $ علشان يبفهم ان دا مش متغير
# دا بالنسبة لل ""
echo "$0.00" # output > ./bash.sh
echo "\$5.00" # output > $5.00

# '' => Single Quotes >> مش بتفهم المتغير الي جوها بتعتبر كله نص واحد
var2="Single Quotes"
echo 'Hello $var2' # output > Hello $var2

# امال لو بنستخدم '' الامر بيختلف بيفهم ان كل الي مكتوب جوها نص واحد
echo '$5.00' # output > $5.00

# `` => Backticks => تستخدم لتطبيق امر معين وهذه طريقه قديمه
echo "Date : `date`" # دي الطريقه القديمه => Date : Thu, Apr 16, 2026 11:10:19 am

echo "Date : $(date)" # دي الطريقه الجديده => Date : Thu, Apr 16, 2026 11:10:19 am

#? ------------------------------------- 05 -------------------------------------
# Video 5 => https://www.youtube.com/watch?v=ex60OTFAfm0&list=PLBdyyeW_Z41DykncH9zzMk8T7Rm5UlZXd&index=5
#? ------------------------------------- 05 -------------------------------------
